Repository: avdeevsv91/deus_offline_updater
Catalog: languages/*.po
Languages: ru_ru

source: Deus Offline Updater started (version %1).
ru_ru: Deus Offline Updater запущен (версия %1).

source: Can`t open config file! Will be used default settings.
ru_ru: Невозможно открыть файл конфигурации! Будут использованы настройки по умолчанию.

source: Warning!
ru_ru: Предупреждение!

source: This software IS NOT OFFICIAL updater and is intended for use solely for informational purposes. The author is not responsible for any damage (material, moral or other) caused to you or third parties resulting from the use of this software. All the steps you are at your own risk!
ru_ru: Внимание! Данная программа обновления НЕ ЯВЛЯЕТСЯ ОФИЦИАЛЬНОЙ и предназначена для использования исключительно в ознакомительных целях. Автор не несет ответственности за любой вред (материальный, моральный или иной), причиненный вам или третьим лицам, в результате использования данного программного обеспечения. Все действия вы производите на свой страх и риск!

source: Current settings:
ru_ru: Текущие настройки:

source: Software updates = %1;
ru_ru: Обновления программы = %1;

source: Debug mode = %1;
ru_ru: Режим отладки = %1;

source: Firmware updates = %1;
ru_ru: Обновления прошивок = %1;

source: Beta firmwares = %1;
ru_ru: Бета прошивки = %1;

source: File deletion = %1;
ru_ru: Удаление файлов = %1;

source: The directory &#34;%1&#34; does not exist! Create it...
ru_ru: Директория &#34;%1&#34; не существует! Создаем ее...

source: DONE!
ru_ru: ГОТОВО!

source: ERROR!
ru_ru: ОШИБКА!

source: Clear directory &#34;%1&#34;...
ru_ru: Очищаем директорию &#34;%1&#34;...

source: Delete directory &#34;%1&#34;...
ru_ru: Удаляем директорию &#34;%1&#34;...

source: Delete file &#34;%1&#34;...
ru_ru: Удаляем файл &#34;%1&#34;...

source: Rename the directory with cache &#34;%1&#34; to &#34;%2&#34;...
ru_ru: Переименовываем каталог с кэшем &#34;%1&#34; в &#34;%2&#34;...

source: The software was successfully updated!
ru_ru: Программа была успешно обновлена!

source: Information
ru_ru: Информация

source: The software was successfully installed!
ru_ru: Программа была успешно установлена!

source: Unsupported startup key: %1
ru_ru: Неподдерживаемый ключ запуска: %1

source: Software updating...
ru_ru: Обновление программы...

source: Check for software updates...
ru_ru: Проверка обновлений программы...

source: Download file &#34;%1&#34;...
ru_ru: Загрузка файла &#34;%1&#34;...

source: Read last software version from file &#34;%1&#34;...
ru_ru: Получаем номер последней версии программы из файла &#34;%1&#34;...

source: A new version %1 of the software is available.
ru_ru: Доступна новая версия программы: %1.

source: Question
ru_ru: Вопрос

source: New version %1 is available! Install the update? Information: it is recommended to always install the latest versions of the software, as they may contain important updates, fixes for the correct installation of firmware or new functionality.
ru_ru: Доступна новая версия %1! Установить обновление? Информация: рекомендуется всегда устанавливать последние версии программного обеспечения, так как они могут содержать важные обновления, исправления для корректной установки прошивок или новый функционал.

source: Execute file &#34;%1&#34;...
ru_ru: Выполняем файл &#34;%1&#34;...

source: The software update has been canceled by user.
ru_ru: Обновление программы отменено пользователем.

source: There are no updates available.
ru_ru: Нет доступных обновлений.

source: Software update finished.
ru_ru: Обновление программы завершено.

source: The software update is disabled in the settings.
ru_ru: Обновление программы отключено в настройках.

source: Firmware updating...
ru_ru: Обновление прошивок...

source: Checking the firmware update...
ru_ru: Проверка обновлений прошивок...

source: Firmware updating (%1 of %2)...
ru_ru: Обновление прошивок (%1 из %2)...

source: Create directory &#34;%1&#34;...
ru_ru: Создаем директорию &#34;%1&#34;...

source: Copy file &#34;%1&#34; to &#34;%2&#34;...
ru_ru: Копируем файл &#34;%1&#34; в &#34;%2&#34;...

source: Can`t open file &#34;%1&#34;!
ru_ru: Невозможно открыть файл &#34;%1&#34;!

source: The &#34;%1&#34; file may be corrupted!
ru_ru: Возможно файл &#34;%1&#34; поврежден!

source: The firmware update is disabled in the settings.
ru_ru: Обновление прошивок отключено в настройках.

source: Updates finished.
ru_ru: Обновление завершено.

source: Updating
ru_ru: Обновление

source: Cancel
ru_ru: Отмена

source: Check for new updates...
ru_ru: Проверка новых обновлений...

source: Do you really want to abort the update? In some cases, this can damage the local cache.
ru_ru: Вы действительно хотите прервать обновление? В некоторых случаях это может привести к повреждению локального кэша.

source: The update has been canceled by user.
ru_ru: Обновление отменено пользователем.

source: Updating is impossible: no network connection.
ru_ru: Обновление невозможно: отсутствует подключение к сети.

source: Updating is disabled in settings.
ru_ru: Обновление отключено в настройках.

source: Formation of the &#34;%1&#34; file...
ru_ru: Формирование файла &#34;%1&#34;...

source: Add version string &#34;%1&#34;;
ru_ru: Добавляем строку с версией &#34;%1&#34;;

source: Can`t examine directory &#34;%1&#34;!
ru_ru: Не удалось прочитать директорию &#34;%1&#34;!

source: HTTP/GET file &#34;%1&#34;...
ru_ru: HTTP/GET файл &#34;%1&#34;...

source: OK-200 (%1 bytes)!
ru_ru: OK-200 (%1 байт)!

source: ERROR-404!
ru_ru: ОШИБКА-404!

source: 404 Not Found
ru_ru: 404 Не найдено

source: Not Found
ru_ru: Не найдено

source: The requested URL %1 was not found on this server.
ru_ru: Запрошенный URL %1 недоступен.

source: ERROR-404 (header location %1)!
ru_ru: ОШИБКА-404 (перенаправляем на %1)!

source: HTTP/UNKNOWN request...
ru_ru: HTTP/НЕИЗВЕСТНЫЙ запрос...

source: ERROR-400!
ru_ru: ОШИБКА-400!

source: 400 Bad Request
ru_ru: 400 Неверный запрос

source: Bad Request
ru_ru: Неверный запрос

source: Your browser sent a request that this server could not understand.
ru_ru: Ваш браузер послал запрос, который сервер не смог обработать.

source: Create a network server on port %1...
ru_ru: Запускаем HTTP сервер на порту %1...

source: Execute file %1...
ru_ru: Выполняем файл %1...

source: Error
ru_ru: Ошибка

source: Can`t execute the %1 file!
ru_ru: Невозможно запустить файл %1!

source: Can`t create the http server on port %1!
ru_ru: Невозможно запустить HTTP сервер на порту %1!

source: The program is completed.
ru_ru: Завершение работы программы.

source: DOU: Settings (version %1)
ru_ru: DOU: Настройки (версия %1)

source: Online updates
ru_ru: Онлайн обновления

source: Check for software updates
ru_ru: Проверять обновления программы

source: Download firmware updates
ru_ru: Загружать обновления прошивок

source: Including beta versions
ru_ru: В том числе и бета версии

source: Allow file deletion
ru_ru: Разрешить удаление файлов

source: Enable debug mode
ru_ru: Включить режим отладки

source: Save
ru_ru: Сохранить

source: Help
ru_ru: Помощь

source: Can`t create config file! The current settings will be lost.
ru_ru: Невозможно создать файл конфигурации! Текущие настройки будут потеряны.
